# Part 2: Full Data Workflow A-Z

## Data Preparation and Feature Creation

### Arithmetic Operations

In [1]:
import pandas as pd
import numpy as np

In [7]:
titanic = pd.read_csv("titanic.csv")

In [8]:
titanic.head(10)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN
5         0       3    male   NaN      0      0   8.4583        Q  NaN
6         0       1    male  54.0      0      0  51.8625        S    E
7         0       3    male   2.0      3      1  21.0750        S  NaN
8         1       3  female  27.0      0      2  11.1333        S  NaN
9         1       2  female  14.0      1      0  30.0708        C  NaN

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [9]:
titanic.age.fillna(titanic.age.mean(), inplace = True)
#Na값을 평균값으로 교체

C:\Users\halim\AppData\Local\Temp\ipykernel_15040\365094017.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic.age.fillna(titanic.age.mean(), inplace = True)

In [10]:
titanic.head(10)

   survived  pclass     sex        age  sibsp  parch     fare embarked deck
0         0       3    male  22.000000      1      0   7.2500        S  NaN
1         1       1  female  38.000000      1      0  71.2833        C    C
2         1       3  female  26.000000      0      0   7.9250        S  NaN
3         1       1  female  35.000000      1      0  53.1000        S    C
4         0       3    male  35.000000      0      0   8.0500        S  NaN
5         0       3    male  29.699118      0      0   8.4583        Q  NaN
6         0       1    male  54.000000      0      0  51.8625        S    E
7         0       3    male   2.000000      3      1  21.0750        S  NaN
8         1       3  female  27.000000      0      2  11.1333        S  NaN
9         1       2  female  14.000000      1      0  30.0708        C  NaN

#### Add/Sub/Mul/Div of Columns

In [11]:
titanic.sibsp + titanic.parch

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

In [12]:
titanic.sibsp.add(titanic.parch)
#+보다는 .add메서드가 데이터 양이 많을수록 속도가 빠르다

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

In [13]:
titanic["no_relat"] = titanic.sibsp.add(titanic.parch)

In [14]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,no_relat
0,0,3,male,22.0,1,0,7.2500,S,NaN,1
1,1,1,female,38.0,1,0,71.2833,C,C,1
2,1,3,female,26.0,0,0,7.9250,S,NaN,0
3,1,1,female,35.0,1,0,53.1000,S,C,1
4,0,3,male,35.0,0,0,8.0500,S,NaN,0

In [15]:
sales = pd.read_csv("sales.csv", index_col = 0)

In [16]:
sales

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [17]:
sales.Mon + sales.Thu

Steven      NaN
Mike      132.0
Andi       25.0
Paul      132.0
dtype: float64

In [18]:
sales.Mon.add(sales.Thu, fill_value=0)
#add메서를 사용할 경우 Na값을 0으로 바꾼 뒤에 연산이 가능해진다.
#+기호만 사용할 경우에는 NaN+숫자이기 때문에 결과가 NaN으로 나옴

Steven     34.0
Mike      132.0
Andi       25.0
Paul      132.0
dtype: float64

In [19]:
sales["perc_Bonus"] = [0.12, 0.15, 0.10, 0.20]

In [21]:
sales

        Mon  Tue  Wed   Thu  Fri  perc_Bonus
Steven   34   27   15   NaN   33        0.12
Mike     45    9   74  87.0   12        0.15
Andi     17   33   54   8.0   29        0.10
Paul     87   67   27  45.0    7        0.20

In [22]:
sales.Thu * sales.perc_Bonus

Steven      NaN
Mike      13.05
Andi       0.80
Paul       9.00
dtype: float64

In [23]:
sales.Thu.mul(sales.perc_Bonus, fill_value=0)
#add 메서드와 같은내용

Steven     0.00
Mike      13.05
Andi       0.80
Paul       9.00
dtype: float64

In [24]:
sales.iloc[:, :-1].sum(axis = 1).mul(sales.perc_Bonus)

Steven    13.08
Mike      34.05
Andi      14.10
Paul      46.60
dtype: float64

In [ ]:
sales["Bonus"] = sales.iloc[:, :-1].sum(axis = 1).mul(sales.perc_Bonus)

In [ ]:
sales

#### Add/Sub/Mul/Div with Scaler Value

In [ ]:
titanic.head()

In [ ]:
1912 - titanic.age

In [ ]:
titanic["YoB"] = titanic.age.sub(1912).mul(-1)

In [ ]:
titanic.head()

In [ ]:
fx_rate = 1.1

In [ ]:
titanic["EUR_fare"] = titanic.fare.div(fx_rate)

In [ ]:
titanic.head()

In [ ]:
titanic.drop(columns = ["sibsp", "parch", "deck", "YoB", "EUR_fare"], inplace =True)

In [ ]:
titanic.head()

In [ ]:
sales

In [ ]:
fixed_costs = 5

In [ ]:
sales.iloc[:, :-2].sub(fixed_costs, fill_value = 0)

In [ ]:
perc_Bonus = 0.1

In [ ]:
sales.iloc[:, :-2].mul(perc_Bonus, fill_value = 0)

In [ ]:
sales.iloc[:,:-2]

In [ ]:
lot_size = 10
bonus_per_lot = 1.25

In [ ]:
sales.iloc[:, :-2].floordiv(lot_size, fill_value = 0).mul(bonus_per_lot).sum(axis = 1)

### Transformation / Mapping

In [ ]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [ ]:
sample = summer.sample(n = 7, random_state = 123).sort_values(by = "Year")

In [ ]:
sample

In [ ]:
city_country = {"Paris":"France", "Mexico":"Mexico", "Montreal":"Canada", "Moscow":"Russia", "Barcelona":"Spain", "Athens": "Greece"}

In [ ]:
city_country

In [ ]:
sample.City.map(city_country)

In [ ]:
sample["Host_Country"] = sample.City.map(city_country)

In [ ]:
sample

In [ ]:
titanic.head()

In [ ]:
mapper = {1:"First", 2:"Second", 3:"Third"}

In [ ]:
titanic.pclass.map(mapper)

In [ ]:
titanic.pclass = titanic.pclass.map(mapper)

In [ ]:
titanic.head()

### Conditional Transformation

In [ ]:
titanic.head(10)

In [ ]:
titanic.no_relat == 0

In [ ]:
pd.Series(np.where(titanic.no_relat == 0, "Yes", "No"))

In [ ]:
titanic["alone"] = pd.Series(np.where(titanic.no_relat == 0, "Yes", "No"))

In [ ]:
titanic.head(10)

In [ ]:
titanic["child"] = pd.Series(np.where(titanic.age < 18, "Yes", "No"))

In [ ]:
titanic.head(10)

### Discretization and Binning with pd.cut() (Part 1)

In [ ]:
titanic.head(10)

In [ ]:
age_bins = [0, 10, 18, 30, 55, 100]

In [ ]:
cats = pd.cut(titanic.age, age_bins, right = False)

In [ ]:
cats

In [ ]:
cats.value_counts()

In [ ]:
titanic["age_cat"] = cats

In [ ]:
titanic.head()

In [ ]:
titanic.groupby("age_cat").survived.mean()

In [ ]:
group_names = ["child", "teenager", "young_adult", "adult", "elderly"]

In [ ]:
pd.cut(titanic.age, age_bins, right = False, labels = group_names)

In [ ]:
titanic["age_cat"] = pd.cut(titanic.age, age_bins, right = False, labels = group_names)

In [ ]:
titanic.head(10)

In [ ]:
titanic.age_cat

### Discretization and Binning with pd.cut() (Part 2)

In [ ]:
titanic.fare

In [ ]:
pd.cut(titanic.fare, 5, precision= 3)

In [ ]:
titanic["fare_cat"] = pd.cut(titanic.fare, 5, precision= 0)

In [ ]:
titanic.head(10)

In [ ]:
titanic.fare_cat.value_counts()

### Discretization and Binning with pd.qcut()

In [ ]:
titanic.head()

In [ ]:
pd.qcut(titanic.fare, 5)

In [ ]:
titanic["fare_cat"] = pd.qcut(titanic.fare, 5)

In [ ]:
titanic.head()

In [ ]:
titanic.fare_cat.value_counts()

In [ ]:
pd.qcut(titanic.fare, [0, 0.1, 0.25, 0.5, 0.9, 1], precision = 0)

In [ ]:
fare_labels =["very_cheap", "cheap", "moderate", "exp", "very_exp"]

In [ ]:
titanic["fare_cat"] =  pd.qcut(titanic.fare, [0, 0.1, 0.25, 0.5, 0.9, 1], precision = 0, labels = fare_labels)

In [ ]:
titanic.head()

In [ ]:
titanic.fare_cat.value_counts()

In [ ]:
titanic.groupby(["age_cat", "fare_cat"]).survived.mean().unstack()

### Caps and Floors

In [ ]:
titanic.head()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
titanic.fare.plot(figsize = (12,8))
plt.show()

In [ ]:
titanic.fare.describe()

In [ ]:
titanic.fare.sort_values(ascending = False)

In [ ]:
fare_cap = 250

In [ ]:
titanic.loc[titanic.fare > fare_cap, "fare"] = fare_cap

In [ ]:
fare_floor = 5

In [ ]:
titanic.loc[titanic.fare < fare_floor, "fare"] = fare_floor

In [ ]:
titanic.head()

### Scaling / Standardization

In [ ]:
titanic.head()

In [ ]:
titanic.describe()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
titanic.fare.plot(figsize = (12,8))
titanic.age.plot(figsize = (12,8))
plt.show()

In [ ]:
mean_age = titanic.age.mean()
mean_fare = titanic.fare.mean()

In [ ]:
std_age = titanic.age.std()
std_fare = titanic.fare.std()

In [ ]:
titanic["age_z"] = round((titanic.age-mean_age) / std_age,2)
titanic["fare_z"] = round((titanic.fare-mean_fare) / std_fare,2)

In [ ]:
titanic.head(10)

In [ ]:
round(titanic.describe(),2)

In [ ]:
titanic.fare_z.plot(figsize = (12,8))
titanic.age_z.plot(figsize = (12,8))
plt.show()

In [ ]:
#titanic.to_csv("titanic_prep.csv", index = False)

In [ ]:
titanic.head()

In [ ]:
titanic.drop(labels = ["age", "alone", "child", "age_z", "fare_z", "fare_cat"], axis = 1, inplace = False)

### Creating Dummy Variables

In [ ]:
titanic.head()

In [ ]:
titanic.drop(labels = ["age", "alone", "child", "age_z", "fare_z", "fare_cat"], axis = 1, inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic_d = pd.get_dummies(titanic, columns = ["sex", "pclass", "embarked", "age_cat"], drop_first=True)

In [ ]:
titanic_d.head()

In [ ]:
titanic_d.info()

### String Operations

In [ ]:
import pandas as pd

In [ ]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [ ]:
summer.Athlete = summer.Athlete.str.title()

In [ ]:
summer.Athlete.str.split(", ", n = 1, expand = True)

In [ ]:
summer[["Surname", "First_Name"]] = summer.Athlete.str.split(", ", n = 1, expand = True)

In [ ]:
summer.head()

In [ ]:
summer["Surname"] = summer.Surname.str.strip()

In [ ]:
summer["First_Name"] = summer.First_Name.str.strip()

In [ ]:
summer.drop(columns = "Athlete")